[
  {
    "term": "blockchain",
    "meaning": "Blockchain is a decentralized digital ledger that anyone can access and can be used to store and transfer data without the need for a central authority. Blockchains are the underlying technology that allows cryptocurrency systems like Bitcoin and Ethereum to function."
  },
  {
    "term": "faucet",
    "meaning": "A faucet in the web3 world refers to a website, application or any system that gives tokens to its users upon making a request. This token can either be free or awarded for performing certain tasks."
  },
  {
    "term": "hot wallet",
    "meaning": "A hot wallet mainly refers to an application or a software that is connected to the internet and helps you in managing you crypto holdings online. Since this wallet is conneected to the internet, it might be vulnerable to security issues. Example: Metamask, Coinbase."
  },
  {
    "term": "abi",
    "meaning": "The term ABI is an acronym for application binary interface which acts as an interface between two binary modules. It is mainly a set of rules or protocols that is used to standardize the communication with a smart contract in the ethereum ecosystem."
  },
  {
    "term": "evm",
    "meaning": "EVM os ethereum virtual machine is basicaly an application used by developers to deploy decentraliized applications on the ethereum blockchain. It is what defines the set of rules for computing a new valid state from one block to the other."
  },
  {
    "term": "cold wallet",
    "meaning": "A cold wallet refers to a wallet which is not connected to the internet. It is a way of storing your cryptocurrencies offline, in a device that is usually protected with a PIN/password thereby adding two additional layers of security. Example: Paper wallet, USB wallet."
  },
  {
    "term": "bitcoin",
    "meaning": "Satoshi Nakamoto, a pseudonym, developed the first decentralized, peer-to-peer digital money in 2009. Unlike government-issued currencies, Bitcoin boasts lower transaction fees than existing online payment options and is managed by a decentralized authority."
  },
  {
    "term": "satoshi",
    "meaning": "Satoshi the smallest denomination of BTC, equal to 0.00000001 bitcoin. Satoshis are named after Bitcoin’s pseudonymous creator, Satoshi Nakamoto."
  },
  {
    "term": "block",
    "meaning": "A block is a group of transactions that have been recorded on the blockchain. Every block has information about the block preceding it, allowing them to communicate with one another."
  },
  {
    "term": "airdrop",
    "meaning": "Airdrop is a marketing strategy in which crypto projects send their native tokens directly to their users' wallets to enhance adoption and awareness."
  },
  {
    "term": "block explorer",
    "meaning": "Block Explorer is a tool for browsing blockchain data, including transactions, wallet addresses, market capitalizations, and hash rates."
  },
  {
    "term": "bridge",
    "meaning": "A protocol allows different blockchains to interact, allowing data, coins, and other information to be transferred between systems."
  },
  {
    "term": "burn",
    "meaning": "Burning entails withdrawing several tokens from circulation for good. The burning process is accomplished by moving the tokens in question to a burn address, a wallet from which they cannot be retrieved. However, It is often referred to as token destruction."
  },
  {
    "term": "decentralized autonomous organization",
    "meaning": "DAO is an open-source organization that its users manage. DAOs are focused on a single project or objective, and they substitute the traditional hierarchical processes of legacy organizations for blockchain-based principles."
  },
  {
    "term": "dao",
    "meaning": "DAO is an open-source organization that its users manage. DAOs are focused on a single project or objective, and they substitute the traditional hierarchical processes of legacy organizations for blockchain-based principles."
  },
  {
    "term": "decentralized application",
    "meaning": "A Dapp is a blockchain-based application built with open-source technology. Dapps live independently of centralized groups or figures, and they frequently use awarded tokens to incentivize users to keep them up to date."
  },
  {
    "term": "vaporware",
    "meaning": "Vaporware is a product or project that is announced and marketed but never actually materializes."
  },
  {
    "term": "tvl",
    "meaning": "Total Value Locked(TVL), a measure of the assets locked into an dapp’s smart contract, usually expressed in USD."
  },
  {
    "term": "dapp",
    "meaning": "A Dapp is a blockchain-based application built with open-source technology. Dapps live independently of centralized groups or figures, and they frequently use awarded tokens to incentivize users to keep them up to date."
  },
  {
    "term": "wagmi",
    "meaning": "We're All Gonna Make It, a famous phrase in crypto and trading circles, denotes friendship and optimism."
  },
  {
    "term": "web1.0",
    "meaning": "Web1.0 is the earliest version of the internet, also known as the 'read-only web' Information-based static websites defined web1.0. User interaction and user-generated material were minimal."
  },
  {
    "term": "web1",
    "meaning": "Web1 is the earliest version of the internet, also known as the 'read-only web' Information-based static websites defined web1. User interaction and user-generated material were minimal."
  },
  {
    "term": "web2.0",
    "meaning": "The 'read-write web,' which began in the 1990s, is distinguished by user-generated content and enhanced user interfaces. Web2 emphasizes user experience and interoperability across different applications and websites, resulting in an extensive network of linked websites."
  },
  {
    "term": "web2",
    "meaning": "The 'read-write web,' which began in the 1990s, is distinguished by user-generated content and enhanced user interfaces. Web2 emphasizes user experience and interoperability across different applications and websites, resulting in an extensive network of linked websites."
  },
  {
    "term": "web3",
    "meaning": "The 'decentralized web' is the set of web applications that don't rely on centralized server/entities to work. Common features of Web3 are the use of smart contracts and decentralized file storage. Key is the focus on the user, who keeps control of its actions, data and content."
  },
  {
    "term": "web3.0",
    "meaning": "The 'decentralized web' is the set of web applications that don't rely on centralized server/entities to work. Common features of Web3 are the use of smart contracts and decentralized file storage. Key is the focus on the user, who keeps control of its actions, data and content."
  },
  {
    "term": "ethereum",
    "meaning": "Ethereum is a decentralized application platform built on a public blockchain for digital money, international payments, and applications. The community has created a thriving digital economy and innovative new ways for creators to make money online."
  },
  {
    "term": "coin",
    "meaning": "A coin, such as BTC, ETH, etc., is a cryptocurrency developed on a native blockchain and meant to be used as a store of value and medium of exchange inside that ecosystem."
  },
  {
    "term": "collateral",
    "meaning": "Collateral can be a tangible asset like real estate or a digital investment like an NFT, and it can be used as collateral for a loan. In traditional banking, a typical example of collateral is a mortgage."
  },
  {
    "term": "Transactions per second",
    "meaning": "TPS - the number of transactions that a blockchain can handle per second, used as a benchmark to measure its computational power."
  },
  {
    "term": "decentralized finance",
    "meaning": "DeFi is an ecosystem of borderless, trustless, peer-to-peer financial instruments developed on public blockchains without banks. Learn more 👉 https://blog.idrisolubisi.com/defi-decentralized-finance-explain-like-i-am-5"
  },
  {
    "term": "defi",
    "meaning": "DeFi is an ecosystem of borderless, trustless, peer-to-peer financial instruments developed on public blockchains without banks. Learn more 👉 https://blog.idrisolubisi.com/defi-decentralized-finance-explain-like-i-am-5"
  },
  {
    "term": "smart contract",
    "meaning": "A smart contract is a self-executing code that is deployed on a blockchain. Smart contracts eliminate the requirement for a central authority, legal system, or external enforcement mechanism to carry out trustworthy transactions and agreements between distant, anonymous participants."
  },
  {
    "term": "shill",
    "meaning": "Shill describes a person that is engaged in advertising a cryptocurrency or NFT project by endorsing the project or product in public forums or communities."
  },
  {
    "term": "wallet",
    "meaning": "A wallet is a software application or hardware device that holds the private keys to blockchain assets and accounts. Unlike a typical wallet, a blockchain wallet does not contain the currencies or tokens themselves. Instead, they save the private key that certifies a digital asset's ownership."
  },
  {
    "term": "dex",
    "meaning": "DEX (Decentralized Exchange) is a blockchain-based peer-to-peer cryptocurrency exchange. Instead of an intermediary person or centralized institution, a DEX is run by its users and smart contracts."
  },
  {
    "term": "decentralized exchange",
    "meaning": "DEX (Decentralized Exchange) is a blockchain-based peer-to-peer cryptocurrency exchange. Instead of an intermediary person or centralized institution, a DEX is run by its users and smart contracts."
  },
  {
    "term": "decentralized",
    "meaning": "A decentralized system runs without the supervision of a central figure of authority instead of relying on a distributed peer-to-peer network."
  },
  {
    "term": "dyor",
    "meaning": "The phrase do your own research reminds people to do their research before investing in a specific asset."
  },
  {
    "term": "do your own research",
    "meaning": "The phrase do your own research reminds people to do their research before investing in a specific asset."
  },
  {
    "term": "slippage",
    "meaning": "Slippage is the difference between the listed price of a cryptocurrency and the price at which a deal executes."
  },
  {
    "term": "fork",
    "meaning": "A fork is a modification to the protocol of a blockchain. It results in a soft fork when the changes are minor. When the improvements are more fundamental, a hard fork may occur, resulting in the development of a second chain with its own set of rules."
  },
  {
    "term": "fork (hard)",
    "meaning": "A hard fork is a significant alteration to a blockchain that is incompatible with the current protocol and necessitates the creation of a new chain."
  },
  {
    "term": "hard fork",
    "meaning": "A hard fork is a significant alteration to a blockchain that is incompatible with the current protocol and necessitates the creation of a new chain."
  },
  {
    "term": "fork (soft)",
    "meaning": "A soft fork is a blockchain upgrade that is backward compatible. These changes do not necessitate the formation of a new chain, unlike a hard fork."
  },
  {
    "term": "soft fork",
    "meaning": "A soft fork is a blockchain upgrade that is backward compatible. These changes do not necessitate the formation of a new chain, unlike a hard fork."
  },
  {
    "term": "transaction hash",
    "meaning": "Transaction Hash (Txn Hash) is a long string of letters and digits that serves as a unique identifier for a given transaction. You may find the specifics of a transaction by pasting a txn hash into a block explorer like Etherscan."
  },
  {
    "term": "stablecoin",
    "meaning": "Stablecoin is a token whose value is linked to a different asset. These coins are usually backed by a fiat currency, such as the US dollar. Still, they can also be supported by tangible assets such as precious metals or even other cryptocurrencies, such as Bitcoin."
  },
  {
    "term": "full node",
    "meaning": "A full node is a blockchain node that verifies and relays transactions while also storing the blockchain's entire history."
  },
  {
    "term": "fractionalize",
    "meaning": "Fractionalization encodes an NFT in a smart contract and breaks it into smaller pieces distributed as fungible tokens. It decreases ownership costs and allows a community to own artwork and other digital assets."
  },
  {
    "term": "slashing",
    "meaning": "Slashing is the process of a validator's staked bitcoin being burned or redistributed as a penalty for allowing fraudulent charges or otherwise damaging the network."
  },
  {
    "term": "token",
    "meaning": "A token is a digital asset established on a blockchain that already exists. Tokens represent digital and physical assets and interact with decentralized applications (Dapps)."
  },
  {
    "term": "transaction",
    "meaning": "A transaction is a data that has been added to a blockchain. Nodes on the network verify new transactions before broadcasting them to other nodes. The transaction is considered genuine and added to a block if enough nodes have validated it."
  },
  {
    "term": "p2p (peer-to-peer)",
    "meaning": "P2P refers to a network of two or more computers that communicate directly without a central server or entity."
  },
  {
    "term": "peer to peer",
    "meaning": "peer to peer refers to a network of two or more computers that communicate directly without a central server or entity."
  },
  {
    "term": "p2p",
    "meaning": "P2P refers to a network of two or more computers that communicate directly without a central server or entity."
  },
  {
    "term": "metaverse",
    "meaning": "A metaverse is a network of 3D virtual worlds, augmented reality, game consoles, and mobile devices focused on social connection."
  },
  {
    "term": "testnet",
    "meaning": "Testnet is a software environment that resembles the mainnet blockchain and is used to test network upgrades and smart contracts before they are deployed to the mainnet."
  },
  {
    "term": "wallet address",
    "meaning": "Like a bank account number, a wallet address is an alphanumeric identifier that serves as the address for a blockchain wallet. Other users can send digital assets to your wallet using your public key, but the contents of your wallet are only accessible using your private key."
  },
  {
    "term": "wei",
    "meaning": "Wei is the smallest ether denomination, named after Wei Dai, a cypherpunk and cryptocurrency pioneer. One ether = 10^18 gwei"
  },
  {
    "term": "sha256",
    "meaning": "The Secure Hashing Algorithm (SHA) is a set of cryptographic hashing functions developed by the National Security Agency (NSA). SHA-256 takes an input of data and generates a hash, which is a long series of letters and numbers. This hash is then used to represent the data securely."
  },
  {
    "term": "sha-256",
    "meaning": "The Secure Hashing Algorithm (SHA) is a set of cryptographic hashing functions developed by the National Security Agency (NSA). SHA-256 takes an input of data and generates a hash, which is a long series of letters and numbers. This hash is then used to represent the data securely."
  },
  {
    "term": "sharding",
    "meaning": "Sharding is a technique for breaking down a network's nodes into smaller groups (shards) to improve scalability. These shards can then reach a consensus on behalf of the entire network, eliminating the requirement for each node to execute each transaction."
  },
  {
    "term": "scalability",
    "meaning": "Scalability is a protocol’s capacity to handle higher demand and increase transaction throughput as the network grows"
  },
  {
    "term": "rug pull",
    "meaning": "Rug pulling is a scam technique in which a crypto enterprise takes the monies invested in its protocol and runs with them. If someone can sell a significant amount of the circulating supply, the supply will rapidly expand, causing the asset's price to drop."
  },
  {
    "term": "rekt",
    "meaning": "Rekt as in “wrecked,” used to express that one has suffered a huge loss."
  },
  {
    "term": "protocol",
    "meaning": "A protocol is a program's basic software layer. A protocol has become a catch-all phrase for both layer one blockchain networks and the layer two applications developed on top of them. Protocols include Bitcoin, Ethereum, Uniswap, and Lightning Network."
  },
  {
    "term": "play to earn",
    "meaning": "Play To Earn: is a business model for the video game industry that allows players to earn digital assets they can sell for money in a marketplace. Many of the assets are NFTs, such as a game skin, cool weapon, or an animal to breed. Examples include Axie Infinity, ZED RUN, Splinterlands, and Cryptofighters."
  },
  {
    "term": "consensus",
    "meaning": "Consensus is an algorithm that aims to make decentralized record-keeping more centralized database-like. The state of agreement among the nodes on a blockchain is often called consensus. A consensus is required to confirm new transactions and add new blocks to the blockchain."
  },
  {
    "term": "mechanism of consensus",
    "meaning": "The consensus mechanism is how nodes on a blockchain agree on a transaction or the network's current state."
  },
  {
    "term": "minting",
    "meaning": "Minting confirms and registers information on the blockchain, such as domain ownership."
  },
  {
    "term": "public key",
    "meaning": "The public key is used to point to your wallet address, an alphanumeric code similar to a bank account number that acts as the address for a blockchain wallet. "
  },
  {
    "term": "private key",
    "meaning": "A private key is an alphanumeric passcode that may be used to withdraw funds from a blockchain wallet and approve digital transactions. Because these private keys are long and difficult to recall, wallets usually associate them with a seed or recovery phrase."
  },
  {
    "term": "oracle",
    "meaning": "Oracle is a service that provides data from the outside world to smart contracts. Smart contracts can't access data off-chain; thus, they rely on oracles like Chainlink and Band Protocol to retrieve, verify, and distribute external data."
  },
  {
    "term": "mining",
    "meaning": "Mining is a Proof of Work (PoW) system. Confirming transactions, grouping them into blocks, and adding blocks to the blockchain is block verification. Miners are those who participate in this procedure."
  },
  {
    "term": "pow",
    "meaning": "PoW is a consensus process in which miners must solve complicated mathematical problems to verify transactions and mint blocks. When miners solve a challenge correctly, they acquire permission to mint the next block and receive the block reward and transaction fees."
  },
  {
    "term": "proof of work",
    "meaning": "PoW is a consensus process in which miners must solve complicated mathematical problems to verify transactions and mint blocks. When miners solve a challenge correctly, they acquire permission to mint the next block and receive the block reward and transaction fees."
  },
  {
    "term": "node",
    "meaning": "A node is any device connecting to a blockchain network is referred to as a node. Different nodes have different levels of responsibility and may be used to validate transactions, maintain the blockchain's history, transmit data, and perform other tasks."
  },
  {
    "term": "nft",
    "meaning": "A digital certificate of authenticity, or NFT, is used to assign and verify a single digital or physical item ownership. NFTs are not convertible with each other, unlike fungible tokens."
  },
  {
    "term": "non-fungible token",
    "meaning": "A digital certificate of authenticity, or NFT, is used to assign and verify a single digital or physical item ownership. NFTs are not convertible with each other, unlike fungible tokens."
  },
  {
    "term": "to the moon",
    "meaning": "The term to the moon suggests that the value of an asset will rise to the point where it will reach the moon. This is utilized by shills, bulls, and virtually everyone during a bull market."
  },
  {
    "term": "mainnet",
    "meaning": "In contrast to a testnet or layer two solutions, the mainnet is a main layer one blockchain."
  },
  {
    "term": "market capitalization",
    "meaning": "The entire worth of an asset is determined by its current market price. The market capitalization of a cryptocurrency is calculated by multiplying the price of a single coin by its circulating supply."
  },
  {
    "term": "liquidity pool",
    "meaning": "The Liquidity Pool collects user-provided funds locked into a smart contract to make trading on a DeFi platform easier. Users must offer liquidity on decentralized exchanges and lending protocols because there is no central bank or figure to do so."
  },
  {
    "term": "liquidity",
    "meaning": "Liquidity refers to how easily an item can be bought, sold, or traded in a given market. Market liquidity and accounting liquidity are the two most common forms of liquidity. Cash is the most liquid asset, whereas tangible assets are less so."
  },
  {
    "term": "erc-1155",
    "meaning": "ERC-1155 is an Ethereum token standard that allows a single, smart contract to manage fungible, non-fungible simultaneously, and semi-fungible tokens. These are often employed in gaming and collector trading to reduce the number of transactions required."
  },
  {
    "term": "erc-20",
    "meaning": "Tokens represent many digital assets in the Ethereum system, including vouchers, IOUs, and even real-world, actual objects. ERC-20 is the Ethereum token standard, which provides fungible tokens with a standardized innovative contract structure."
  },
  {
    "term": "erc-721",
    "meaning": "ERC-721 is a standard for the creation of a new token standard that allows for the creation of a new token type that is not fungible. ERC-721 is used by the Ethereum Virtual Machine (EVM) to create a new token type that is not fungible."
  },
  {
    "term": "fomo",
    "meaning": "FOMO is a sensation of worry caused by missing out on a chance. It usually occurs when investors acquire an asset after it has already experienced a significant price increase, hoping to get in and out before a pullback occurs."
  },
  {
    "term": "fear of missing out",
    "meaning": "FOMO is a sensation of worry caused by missing out on a chance. It usually occurs when investors acquire an asset after it has already experienced a significant price increase, hoping to get in and out before a pullback occurs."
  },
  {
    "term": "genesis block",
    "meaning": "Genesis Block is the first block of a blockchain network."
  },
  {
    "term": "cryptocurrency",
    "meaning": "Cryptocurrency, or crypto, is a type of digital currency that can be used as a medium of exchange. It employs encryption to safeguard and authenticate transactions, as well as to regulate the generation of new digital currency units."
  },
  {
    "term": "ico",
    "meaning": "Initial Coin Offerings (ICOs) are a popular financing tool for firms that want to sell products and services in the cryptocurrency and blockchain arena."
  },
  {
    "term": "icos",
    "meaning": "Initial Coin Offerings (ICOs) are a popular financing tool for firms that want to sell products and services in the cryptocurrency and blockchain arena."
  },
  {
    "term": "initial coin offering",
    "meaning": "Initial Coin Offerings (ICOs) are a popular financing tool for firms that want to sell products and services in the cryptocurrency and blockchain arena."
  },
  {
    "term": "crypto wallet",
    "meaning": "A crypto wallet is a program or software that allows users to engage and interact with blockchain networks directly. Some popular are Coin base, Meta mask, and Wallet connect."
  },
  {
    "term": "gas fees",
    "meaning": "Gas fee is the transaction costs users pay to miners on a blockchain protocol to get their transaction included in the block are referred to as 'gas fees.'"
  },
  {
    "term": "gas fee",
    "meaning": "Gas fee is the transaction fee users pay to miners on a blockchain protocol to get their transaction included in the block are referred to as 'gas fees.'"
  },
  {
    "term": "hodl",
    "meaning": "Hodl is a cryptocurrency technique in which traders are 'hodling on for dear life,' as the name implies. This means that a trader must refrain from selling the cryptocurrency token, even at periods when its value is extremely volatile."
  },
  {
    "term": "buidl",
    "meaning": "In the same way that 'HODL' is a warping of the word 'hold,' BUIDL is a warping of the word 'build.' Instead of passively retaining, BUIDL is a call to arms for growing and contributing to the blockchain and cryptocurrency ecosystem."
  },
  {
    "term": "staking",
    "meaning": "DeFi staking frequently refers to locking up tokens within a protocol to achieve a certain aim or effect, rather than securing block creation."
  },
  {
    "term": "buy the dip",
    "meaning": "Buy the dip, is when you acquire more of an asset after its value has dropped. If the price of Ethereum falls by $4,000, for example, a Ethereum holder might 'buy the dip.'"
  },
  {
    "term": "opensea",
    "meaning": " Opensea is the world's largest NFT exchange, specializing in ethereum-based NFTs."
  },
  {
    "term": "multichain",
    "meaning": "Data, coins, or assets can be sent from one blockchain to another. Multichain services, on the other hand, are designed to work over many blockchains."
  },
  {
    "term": "cross-chain",
    "meaning": "Data, coins, or assets can be sent from one blockchain to another. Cross-chain services, on the other hand, are designed to work over many blockchains."
  },
  {
    "term": "cryptography",
    "meaning": "Cryptography is a type of data encryption in which data can only be decrypted with the use of a key."
  },
  {
    "term": "governance token",
    "meaning": "Governance tokens are cryptocurrencies that give the owner voting rights over the given project."
  },
  {
    "term": "seed phrase",
    "meaning": "You'll be given a 12-word seed phrase when you create a cryptocurrency wallet. You'll need to enter your seed phrase every time you log into your wallet on a new device. Never tell anyone your seed phrase."
  },
  {
    "term": "whitelist",
    "meaning": "A cryptocurrency and non-fungible token presale list. Whitelisted investors have the opportunity to purchase the item before it is released to the general public, often at a discount."
  },
  {
    "term": "etherscan",
    "meaning": "Etherscan is a program that allows you to see information about any Ethereum blockchain transactions that are either pending or confirmed. "
  },
  {
    "term": "allocation",
    "meaning": "Allocation is the allotment of equity or tokens that may be earned, bought, or reserved for a specific team, group, investor, institution, or another similar entity"
  },
  {
    "term": "apeing",
    "meaning": "Apeing is when a cryptocurrency trader buys a token shortly after the token project launch without conducting thorough research."
  },
  {
    "term": "gm",
    "meaning": "Good morning"
  },
  {
    "term": "ngmi",
    "meaning": "Not Gonna to Make It"
  },
  {
    "term": "pos",
    "meaning": "Proof of Stake"
  },
  {
    "term": "fud",
    "meaning": "Fear, Uncertainty, Doubt"
  },
  {
    "term": "lambo",
    "meaning": "Lamborghini"
  },
  {
    "term": "PFP",
    "meaning": "profile picture, usually referring to one of an NFT"
  },
  {
    "term": "L1",
    "meaning": "L1 is a trustable P2P distributed network formed by untrusted nodes implementing a consensus algorithm."
  },
  {
    "term": "L2",
    "meaning": "L2 is a distributed system complimenting L1 providing fast and scalable transaction processing."
  },
  {
    "term": "plebble",
    "meaning": "Plebble is a P2P L1 network implementing cooperative consensus as a substitute to Nakamoto consensus (PoW, PoS)."
  },
  {
    "term": "Yield Farming",
    "meaning": "Yield farming is the process of using decentralized finance (DeFi) to maximize returns. Users lend or borrow crypto on a DeFi platform and earn cryptocurrency in return for their services."
  },
  {
    "term": "Alpha",
    "meaning": "Alpha is a valuable or insider information, usually regarding the value of digital assets like cryptocurrencies and NFTs"
  },
  {
    "term": "Altcoin",
    "meaning": "Altcoin is initially used to refer to any cryptocurrency that wasn’t Bitcoin, altcoin may now refer to any new cryptocurrency with a relatively small market cap."
  },
  {
    "term": "Alts",
    "meaning": "Alts is short for altcoins."
  },
  {
    "term": "Ape",
    "meaning": "Ape is someone who invests heavily into a cryptocurrency or stock or the act of doing so. This is sometimes a reaction to hype and FOMO or done without much knowledge of the asset."
  },
  {
    "term": "All Time High",
    "meaning": "All Time High is the highest price an asset has ever had."
  },
  {
    "term": "Ath",
    "meaning": "All Time High is the highest price an asset has ever had."
  },
  {
    "term": "All Time Low",
    "meaning": "All Time Low is the lowest price an asset has ever had."
  },
  {
    "term": "ATL",
    "meaning": "All Time Low is the lowest price an asset has ever had."
  },
  {
    "term": "Bear Market",
    "meaning": "Bear Market is a prolonged period of decline in a financial market."
  },
  {
    "term": "Bearish",
    "meaning": "Bearish is similar to a bear market, this refers to holding a pessimistic view of a market or asset’s value. If you are bearish on a certain cryptocurrency, you believe its value will decrease over time."
  },
  {
    "term": "Bull Market",
    "meaning": "Bull Market is a prolonged period of growth in a financial market."
  },
  {
    "term": "Centralized",
    "meaning": "Centralized is a hierarchical structure in which authority and control are concentrated within a small group of decision makers."
  },
  {
    "term": "Centralized Exchange",
    "meaning": "Centralized Exchange a cryptocurrency exchange managed by a centralized business or entity. e.g Coinbase etc."
  },
  {
    "term": "Cex",
    "meaning": "Centralized Exchange a cryptocurrency exchange managed by a centralized business or entity. e.g Coinbase etc."
  },
  {
    "term": "Centralized Finance",
    "meaning": "Centralized Finance is a centralized businesses that participate in crypto."
  },
  {
    "term": "CeFi",
    "meaning": "Centralized Finance is a centralized businesses that participate in crypto."
  },
  {
    "term": "Data",
    "meaning": "Data in the context of the internet refers to a user’s personal information."
  },
  {
    "term": "Due Diligence",
    "meaning": "Due Diligence is the process of conducting your research on a cryptocurrency, stock, or other assets before investing. Doing your own DD is essential, as opposed to making an investment based on what someone else says or does."
  },
  {
    "term": "Degen",
    "meaning": "Degen is initially short for “degenerate gambler.” While this still refers to individuals involved with risky bets, degen may also refer more broadly to anyone involved in crypto and financial spaces."
  },
  {
    "term": "Diamond Hands",
    "meaning": "Diamond Hands implies that you are extremely bullish on a specific asset, and have no plans to sell regardless of market volatility, FUD, or extreme drops in price."
  },
  {
    "term": "Difficulty",
    "meaning": "Difficulty is the computing power needed to verify transactions and mine blocks on a proof-of-work blockchain."
  },
  {
    "term": "Difficulty Bomb",
    "meaning": "Difficulty Bomb is increasing the difficulty of a proof-of-work blockchain to motivate the transition to another consensus algorithm (such as proof-of-stake in the case of Ethereum)."
  },
  {
    "term": "EIP",
    "meaning": "EIP is a new feature of the Ethereum blockchain that allows for the creation of smart contracts. These contracts can be used to create new tokens, or to create new functions on the blockchain."
  },
  {
    "term": "Ethereum Improvement Proposal",
    "meaning": "Ethereum Improvement Proposal is a new feature of the Ethereum blockchain that allows for the creation of smart contracts. These contracts can be used to create new tokens, or to create new functions on the blockchain."
  },
  {
    "term": "ERC",
    "meaning": "ERC is the standard smart contract outline on which Ethereum-based smart contracts are built."
  },
  {
    "term": "Ethereum Request for Comments",
    "meaning": "Ethereum Request for Comments is the standard smart contract outline on which Ethereum-based smart contracts are built."
  },
  {
    "term": "floor",
    "meaning": "The floor or floor price is the lowest price to buy an NFT on the secondary market. It’s the most popular metric for tracking an NFT collection’s performance over time and comparing it to others."
  },
  {
    "term": "Few",
    "meaning": "Few is short for “Few understand”. A rallying cry that crypto folks are still early in this space and will make a lot of money when mass adoption comes."
  },
  {
    "term": "Fiat",
    "meaning": "Fiat is a currency that is used to purchase crypto. Fiat is a form of money that is not backed by any crypto."
  },
  {
    "term": "Flippening",
    "meaning": "Flippening is a reference to the possible event of Ethereum becoming more valuable than Bitcoin, in terms of market cap."
  },
  {
    "term": "Fungible",
    "meaning": "Fungible is a term used to describe a token of same kind that can be transferred from one address to another."
  },
  {
    "term": "ABI",
    "meaning": "ABI is the standard way to interact with contracts in the Ethereum ecosystem, both from outside the blockchain and for contract-to-contract interaction."
  },
  {
    "term": "Byzantine Fault Tolerance",
    "meaning": "Byzantine fault is a condition where components of a distributed computer system may fail, with imperfect information on whether a component has failed."
  },
  {
    "term": "finality",
    "meaning": "Finality is the assurance that blockchain transactions, once completed, cannot be altered, reversed canceled. The blockchain latency level affects the finality rate."
  },
  {
    "term": "IPFS",
    "meaning": "IPFS stands for InterPlanetary File System. It's a protocol, an hypermedia, a file sharing p2p network. It's used for storing/sharing data in a distributed file system. It uses content-addressing to uniquely identify each file in a global namespace connecting IPFS hosts."
  },
  {
    "term": "Merkle tree",
    "meaning": "A Merkle tree (also called hash tree) is a tree in which leaf nodes are labeled with the cryptographic hash of a data block and every non-leaf node is labeled with the cryptographic hash of the labels of its child."
  },
  {
    "term": "orphan block",
    "meaning": "Orphan block is a block that has been solved within the blockchain network but was not accepted by the network yet. The network uses both blocks until one chain has more verified blocks than the other. Then, the blocks in the shorter chain are orphaned."
  },
  {
    "term": "blockchain trilemma",
    "meaning": "A blockchain trilemma is a difficult choice between 3 options where a choice of a side disadvantages the third one. The blockchain trilemma is the problem of being very hard, if not impossible, to balance between: decentralization, scalability and security"
  },
  {
    "term": "shit coin",
    "meaning": "A shitcoin is a cryptocurrency with little to no value or digital currency that has no immediate, discernable purpose, it is mostly characterized by short term price increase followed by a huge dump or price decrease by investors who want to capitalize on short-term gains"
  },
  {
    "term": "shitcoin",
    "meaning": "A shitcoin is a cryptocurrency with little to no value or digital currency that has no immediate, discernable purpose, it is mostly characterized by short term price increase followed by a huge dump or price decrease by investors who want to capitalize on short-term gains"
  },
  {
    "term": "GameFi",
    "meaning": "GameFi is a fusion of two words, game and finance. GameFi to gaming on the blockchain that offers economic incentives to players. Example: Play-to-Earn"
  },
  {
    "term": "Game Fi",
    "meaning": "GameFi is a fusion of two words, game and finance. GameFi to gaming on the blockchain that offers economic incentives to players. Example: Play-to-Earn"
  },
  {
    "term": "Proof-of-Stake",
    "meaning": "Proof-of-stake is a type of consensus mechanism used to process and verify transactions, and add them to the blockchain, through staking."
  },
  { "term": "PoS",
    "meaning": "Proof-of-stake is a type of consensus mechanism used to process and verify transactions, and add them to the blockchain, through staking."
  },
  {
    "term": "tokenization",
    "meaning": "Tokenization is the process of exchanging sensitive data for nonsensitive data called tokens that can be used in a database or internal system without bringing it into scope."
  },
  {
    "term": "Dapps",
    "meaning": "A decentralised application is an application that can operate autonomously, typically through the use of smart contracts, that run on a decentralized computing, blockchain or other distributed ledger system"
  }
]
